{
  "entries": [
    {
      "id": 1,
      "date": "07/24/2018",
      "concept": "Array methods",
      "entry": "We learned about 4 different array methods today. forEach made sense, but the others still confuse me.",
      "mood": "Ok"
    },
    {
      "id": 2,
      "date": "04/16/2020",
      "concept": "the DOM",
      "entry": "The day we had to do more practice exercise concerning the DOM. *terrified shudder* Not so coincidentally, also the most challenging day yet. Combining 3 languages, conceptually is just hard y'all. I feel like I'm not getting any better at it, but that's what practice is for, I guess. Hopefully, at the very least, I start to understand the works of what is going on conceptually for the DOM, like the 'what to do' if not the 'how to do it'.",
      "mood": "i'M fInE"
    },
    {
      "id": 3,
      "date": "04/17/2020",
      "concept": "The Road So Far...",
      "entry": "So, we're finishing up Week 2 today, and it is just surreal to think about everything we know now compared to when we started, seemingly just a short while ago. We know the basics of HTML, CSS, and JavaScript. An more importantly, we're learning how to put it all together to create functional pieces of websites and other media content.",
      "mood": "Hopeful"
    },
    {
      "date": "2020-05-08",
      "concept": "Servers",
      "entry": "So, I learned today that I need to create separate sub-directories \"api\" and \"src\" so the JSON server doesn't know that it's running?? So, cd into src and code . through that directory",
      "mood": "i'M fInE",
      "id": 6
    },
    {
      "date": "2020-05-13",
      "concept": "Updating/Editing JSON Objects",
      "entry": "So, there's a lot of information floating around in my brain. I don't understand all of it, and I have a feeling that I won't be able to manually replicate all of it on my own soon, but one day, it'll happen and that's good enough for me for now.",
      "mood": "i'M fInE",
      "id": 7
    },
    {
      "id": 11,
      "date": "2020-05-14",
      "concept": "C.R.U.D.",
      "entry": "I successfully completed C.R.U.D. (create, retrieve, update, and delete) functions for this program! YEEET!",
      "mood": "Happy"
    }
  ]
}